// 1. Задане значення isDay (true - зараз день, false - зараз ніч).
// Вивести напис
// "Світла тема", якщо зараз день,
// "Темна тема", якщо зараз ніч.
// *Стилізувати фразу:
// темний текст на світлому тлі, якщо зараз день,
// світлий текст на темному тлі, якщо зараз ніч.

// const isDay = true;

// let color = null;
// if (isDay) {
//   color = "black";
// } else {
//   color = "white";
// }

// if (isDay) {
//   document.write(`<p style="color:${color};background-color:white;">Світла тема</p>`);
// } else {
//   document.write(`<p style="color:${color};background-color:black;">Темна тема</p>`);
// }

// 2. Відомо, чи користувач онлайн (isOnline).
// Якщо користувач НЕ онлайн, то вивести попередження "Ваше повідомлення буде відправлено при під'єднанні до мережі Інтернет"

// const isOnline = false;

// if (!isOnline) {
//     document.write("<p>Ваше повідомлення буде відправлено при під'єднанні до мережі Інтернет</p>")
// }

// 3. Користувач вводить суму покупки.
// Обчислити та вивести остаточну суму покупки з урахуванням знижки.
// Знижка 3% надається, якщо сума покупки більша за 500 грн., а знижка 5% - якщо сума покупки більша за 800 грн.

// let sumUser = Number(prompt('Введіть суму покупки'));
// if (sumUser >= 500 && sumUser < 800) {
//     console.log('Сума зі знижкою 3%:', sumUser - (sumUser*3)/100);
// } else if (sumUser >= 800) {
//     console.log('Сума зі знижкою 5%:', sumUser - (sumUser*5)/100);
// } else {
//     console.log('Сума', sumUser);
// }

// 📋 Завдання на switch..case

// Познайомитись з оператором множинного вибору
// switch..case
// -- альтернативою для
// if (умова1)
//     інструкція1
// else if (умова2)
//     інструкція2
// else if (умова3)
//     інструкція3
// ...
// else
//     інструкція

// 1. Запитати у користувача номер дня тижня та вивести відповідну повну рядкову назву (наприклад, якщо користувач вводить 7 – виводиться повідомлення "неділя"). Передбачити обробку помилкового введення номера дня тижня (в гілка default, з повідомленням "дня з таким номером не існує").

let arg = prompt("Введіть значення?");
switch (arg) {
  case "1":
    alert("Поненелік");
    break;
  case "2":
    alert("Вівторок");
    break;
  case "3":
    alert("Середа");
    break;
  case "4":
    alert("Четвер");
    break;
  case "5":
    alert("П'ятниця");
    break;
  case "6":
    alert("Субота");
    break;
  case "7":
    alert("Неділя");
    break;
  default:
    alert("Невідоме значення");
}
