// 1. Задане значення isDay (true - зараз день, false - зараз ніч).
// Вивести напис
// "Світла тема", якщо зараз день,
// "Темна тема", якщо зараз ніч.
// *Стилізувати фразу:
// темний текст на світлому тлі, якщо зараз день,
// світлий текст на темному тлі, якщо зараз ніч.

// const isDay = true;

// let color = null;
// if (isDay) {
//   color = "black";
// } else {
//   color = "white";
// }

// if (isDay) {
//   document.write(`<p style="color:${color};background-color:white;">Світла тема</p>`);
// } else {
//   document.write(`<p style="color:${color};background-color:black;">Темна тема</p>`);
// }

// 2. Відомо, чи користувач онлайн (isOnline).
// Якщо користувач НЕ онлайн, то вивести попередження "Ваше повідомлення буде відправлено при під'єднанні до мережі Інтернет"

// const isOnline = false;

// if (!isOnline) {
//     document.write("<p>Ваше повідомлення буде відправлено при під'єднанні до мережі Інтернет</p>")
// }

// 3. Користувач вводить суму покупки.
// Обчислити та вивести остаточну суму покупки з урахуванням знижки.
// Знижка 3% надається, якщо сума покупки більша за 500 грн., а знижка 5% - якщо сума покупки більша за 800 грн.

let sumUser = Number(prompt('Введіть суму покупки'));
if (sumUser >= 500) {
    console.log('Знижка 3%:', sumUser - 3%)
} else (sumUser >= 800) {
        console.log('Знижка 3%:', sumUser - 3%)

}
